ARMmbed/mbed-os/targets/TARGET_MICROCHIP/TARGET_PIC32CX/device/pic32cx.h
/* ---------------------------------------------------------------------------- */
/*                Microchip Microcontroller Software Support                    */
/*                       SAM Software Package License                           */
/* ---------------------------------------------------------------------------- */
/* Copyright (c) 2021, Microchip Technology Inc.                                */
/*                                                                              */
/* All rights reserved.                                                         */
/*                                                                              */
/* Redistribution and use in source and binary forms, with or without           */
/* modification, are permitted provided that the following condition is met:    */
/*                                                                              */
/* - Redistributions of source code must retain the above copyright notice,     */
/* this list of conditions and the disclaimer below.                            */
/*                                                                              */
/* Microchip's name may not be used to endorse or promote products derived from */
/* this software without specific prior written permission.                     */
/*                                                                              */
/* DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS  */
/* OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES */
/* OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT    */
/* ARE DISCLAIMED. IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT,        */
/* INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES           */
/* (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; */
/* LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND  */
/* ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT   */
/* (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF     */
/* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.            */
/* ---------------------------------------------------------------------------- */

#ifndef _PIC32CX_
#define _PIC32CX_

#if defined __PIC32CX1025MTC100_0__
  #include "pic32cx1025mtc100_0.h"
#elif defined __PIC32CX1025MTG64__
  #include "pic32cx1025mtg64.h"
#elif defined __PIC32CX1025MTG100__
  #include "pic32cx1025mtg100.h"
#elif defined __PIC32CX1025MTSH100_0__
  #include "pic32cx1025mtsh100_0.h"
#elif defined __PIC32CX1025MTSH128_0__
  #include "pic32cx1025mtsh128_0.h"
#elif defined __PIC32CX2038MTC100_0__
  #include "pic32cx2038mtc100_0.h"
#elif defined __PIC32CX2038MTG64__
  #include "pic32cx2038mtg64.h"
#elif defined __PIC32CX2038MTG100__
  #include "pic32cx2038mtg100.h"
#elif defined __PIC32CX2038MTSH100_0__
  #include "pic32cx2038mtsh100_0.h"
#elif defined __PIC32CX2038MTSH128_0__
  #include "pic32cx2038mtsh128_0.h"
#elif defined __PIC32CX2051MTC100_0__
  #include "pic32cx2051mtc100_0.h"
#elif defined __PIC32CX2051MTG64__
  #include "pic32cx2051mtg64.h"
#elif defined __PIC32CX2051MTG100__
  #include "pic32cx2051mtg100.h"
#elif defined __PIC32CX2051MTSH100_0__
  #include "pic32cx2051mtsh100_0.h"
#elif defined __PIC32CX2051MTSH128_0__
  #include "pic32cx2051mtsh128_0.h"
#elif defined __PIC32CX5112MTC100_0__
  #include "pic32cx5112mtc100_0.h"
#elif defined __PIC32CX5112MTG64__
  #include "pic32cx5112mtg64.h"
#elif defined __PIC32CX5112MTG100_0__
  #include "pic32cx5112mtg100.h"
#elif defined __PIC32CX5112MTSH100_0__
  #include "pic32cx5112mtsh100_0.h"
#elif defined __PIC32CX5112MTSH128_0__
  #include "pic32cx5112mtsh128_0.h"
#elif defined __PIC32CX1025MTC100_1__
  #include "pic32cx1025mtc100_1.h"
#elif defined __PIC32CX1025MTSH100_1__
  #include "pic32cx1025mtsh100_1.h"
#elif defined __PIC32CX1025MTSH128_1__
  #include "pic32cx1025mtsh128_1.h"
#elif defined __PIC32CX2038MTC100_1__
  #include "pic32cx2038mtc100_1.h"
#elif defined __PIC32CX2038MTSH100_1__
  #include "pic32cx2038mtsh100_1.h"
#elif defined __PIC32CX2038MTSH128_1__
  #include "pic32cx2038mtsh128_1.h"
#elif defined __PIC32CX2051MTC100_1__
  #include "pic32cx2051mtc100_1.h"
#elif defined __PIC32CX2051MTSH100_1__
  #include "pic32cx2051mtsh100_1.h"
#elif defined __PIC32CX2051MTSH128_1__
  #include "pic32cx2051mtsh128_1.h"
#elif defined __PIC32CX5112MTC100_1__
  #include "pic32cx5112mtc100_1.h"
  #include "pic32cx5112mtg100_1.h"
#elif defined __PIC32CX5112MTSH100_1__
  #include "pic32cx5112mtsh100_1.h"
#elif defined __PIC32CX5112MTSH128_1__
  #include "pic32cx5112mtsh128_1.h"
#else
  #error Library does not support the specified device.
#endif

#endif /* _PIC32CX_ */
